---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.RebarShapeConstraint180DegreeDefaultBend
source: html/86fb2231-92d6-034c-bd95-27f518469a1a.htm
---
# RebarShapeConstraint180DegreeDefaultBend Methods

Return the Id of the parameter associated with this constraint.